handali/k6-tests/test-handbook/after-result.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: test-handbook.js
        output: -

     scenarios: (100.00%) 1 scenario, 100 max VUs, 3m20s max duration (incl. graceful stop):
              * default: Up to 100 looping VUs for 2m50s over 7 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 001/100 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 001/100 VUs  0m01.0s/2m50.0s

running (0m02.0s), 001/100 VUs, 1 complete and 0 interrupted iterations
default   [   1% ] 001/100 VUs  0m02.0s/2m50.0s

running (0m03.0s), 002/100 VUs, 2 complete and 0 interrupted iterations
default   [   2% ] 002/100 VUs  0m03.0s/2m50.0s

running (0m04.0s), 002/100 VUs, 4 complete and 0 interrupted iterations
default   [   2% ] 002/100 VUs  0m04.0s/2m50.0s

running (0m05.0s), 003/100 VUs, 6 complete and 0 interrupted iterations
default   [   3% ] 003/100 VUs  0m05.0s/2m50.0s

running (0m06.0s), 003/100 VUs, 9 complete and 0 interrupted iterations
default   [   4% ] 003/100 VUs  0m06.0s/2m50.0s

running (0m07.0s), 004/100 VUs, 12 complete and 0 interrupted iterations
default   [   4% ] 004/100 VUs  0m07.0s/2m50.0s

running (0m08.0s), 004/100 VUs, 16 complete and 0 interrupted iterations
default   [   5% ] 004/100 VUs  0m08.0s/2m50.0s

running (0m09.0s), 005/100 VUs, 20 complete and 0 interrupted iterations
default   [   5% ] 005/100 VUs  0m09.0s/2m50.0s

running (0m10.0s), 005/100 VUs, 25 complete and 0 interrupted iterations
default   [   6% ] 005/100 VUs  0m10.0s/2m50.0s

running (0m11.0s), 005/100 VUs, 30 complete and 0 interrupted iterations
default   [   6% ] 005/100 VUs  0m11.0s/2m50.0s

running (0m12.0s), 006/100 VUs, 35 complete and 0 interrupted iterations
default   [   7% ] 006/100 VUs  0m12.0s/2m50.0s

running (0m13.0s), 006/100 VUs, 40 complete and 0 interrupted iterations
default   [   8% ] 006/100 VUs  0m13.0s/2m50.0s

running (0m14.0s), 007/100 VUs, 46 complete and 0 interrupted iterations
default   [   8% ] 007/100 VUs  0m14.0s/2m50.0s

running (0m15.0s), 007/100 VUs, 53 complete and 0 interrupted iterations
default   [   9% ] 007/100 VUs  0m15.0s/2m50.0s

running (0m16.0s), 008/100 VUs, 60 complete and 0 interrupted iterations
default   [   9% ] 008/100 VUs  0m16.0s/2m50.0s

running (0m17.0s), 008/100 VUs, 68 complete and 0 interrupted iterations
default   [  10% ] 008/100 VUs  0m17.0s/2m50.0s

running (0m18.0s), 009/100 VUs, 76 complete and 0 interrupted iterations
default   [  11% ] 009/100 VUs  0m18.0s/2m50.0s

running (0m19.0s), 009/100 VUs, 84 complete and 0 interrupted iterations
default   [  11% ] 009/100 VUs  0m19.0s/2m50.0s

running (0m20.0s), 009/100 VUs, 93 complete and 0 interrupted iterations
default   [  12% ] 009/100 VUs  0m20.0s/2m50.0s

running (0m21.0s), 010/100 VUs, 102 complete and 0 interrupted iterations
default   [  12% ] 010/100 VUs  0m21.0s/2m50.0s

running (0m22.0s), 010/100 VUs, 112 complete and 0 interrupted iterations
default   [  13% ] 010/100 VUs  0m22.0s/2m50.0s

running (0m23.0s), 010/100 VUs, 122 complete and 0 interrupted iterations
default   [  14% ] 010/100 VUs  0m23.0s/2m50.0s

running (0m24.0s), 010/100 VUs, 132 complete and 0 interrupted iterations
default   [  14% ] 010/100 VUs  0m24.0s/2m50.0s

running (0m25.0s), 010/100 VUs, 142 complete and 0 interrupted iterations
default   [  15% ] 010/100 VUs  0m25.0s/2m50.0s

running (0m26.0s), 010/100 VUs, 148 complete and 0 interrupted iterations
default   [  15% ] 010/100 VUs  0m26.0s/2m50.0s

running (0m27.0s), 010/100 VUs, 158 complete and 0 interrupted iterations
default   [  16% ] 010/100 VUs  0m27.0s/2m50.0s

running (0m28.0s), 010/100 VUs, 168 complete and 0 interrupted iterations
default   [  16% ] 010/100 VUs  0m28.0s/2m50.0s

running (0m29.0s), 010/100 VUs, 178 complete and 0 interrupted iterations
default   [  17% ] 010/100 VUs  0m29.0s/2m50.0s

running (0m30.0s), 010/100 VUs, 188 complete and 0 interrupted iterations
default   [  18% ] 010/100 VUs  0m30.0s/2m50.0s

running (0m31.0s), 010/100 VUs, 198 complete and 0 interrupted iterations
default   [  18% ] 010/100 VUs  0m31.0s/2m50.0s

running (0m32.0s), 010/100 VUs, 208 complete and 0 interrupted iterations
default   [  19% ] 010/100 VUs  0m32.0s/2m50.0s

running (0m33.0s), 010/100 VUs, 218 complete and 0 interrupted iterations
default   [  19% ] 010/100 VUs  0m33.0s/2m50.0s

running (0m34.0s), 010/100 VUs, 227 complete and 0 interrupted iterations
default   [  20% ] 010/100 VUs  0m34.0s/2m50.0s

running (0m35.0s), 010/100 VUs, 237 complete and 0 interrupted iterations
default   [  21% ] 010/100 VUs  0m35.0s/2m50.0s

running (0m36.0s), 010/100 VUs, 247 complete and 0 interrupted iterations
default   [  21% ] 010/100 VUs  0m36.0s/2m50.0s

running (0m37.0s), 010/100 VUs, 257 complete and 0 interrupted iterations
default   [  22% ] 010/100 VUs  0m37.0s/2m50.0s

running (0m38.0s), 010/100 VUs, 267 complete and 0 interrupted iterations
default   [  22% ] 010/100 VUs  0m38.0s/2m50.0s

running (0m39.0s), 010/100 VUs, 277 complete and 0 interrupted iterations
default   [  23% ] 010/100 VUs  0m39.0s/2m50.0s

running (0m40.0s), 010/100 VUs, 287 complete and 0 interrupted iterations
default   [  24% ] 010/100 VUs  0m40.0s/2m50.0s

running (0m41.0s), 010/100 VUs, 296 complete and 0 interrupted iterations
default   [  24% ] 010/100 VUs  0m41.0s/2m50.0s

running (0m42.0s), 010/100 VUs, 306 complete and 0 interrupted iterations
default   [  25% ] 010/100 VUs  0m42.0s/2m50.0s

running (0m43.0s), 010/100 VUs, 316 complete and 0 interrupted iterations
default   [  25% ] 010/100 VUs  0m43.0s/2m50.0s

running (0m44.0s), 010/100 VUs, 326 complete and 0 interrupted iterations
default   [  26% ] 010/100 VUs  0m44.0s/2m50.0s

running (0m45.0s), 010/100 VUs, 336 complete and 0 interrupted iterations
default   [  26% ] 010/100 VUs  0m45.0s/2m50.0s

running (0m46.0s), 010/100 VUs, 346 complete and 0 interrupted iterations
default   [  27% ] 010/100 VUs  0m46.0s/2m50.0s

running (0m47.0s), 010/100 VUs, 356 complete and 0 interrupted iterations
default   [  28% ] 010/100 VUs  0m47.0s/2m50.0s

running (0m48.0s), 010/100 VUs, 365 complete and 0 interrupted iterations
default   [  28% ] 010/100 VUs  0m48.0s/2m50.0s

running (0m49.0s), 010/100 VUs, 375 complete and 0 interrupted iterations
default   [  29% ] 010/100 VUs  0m49.0s/2m50.0s

running (0m50.0s), 010/100 VUs, 385 complete and 0 interrupted iterations
default   [  29% ] 010/100 VUs  0m50.0s/2m50.0s

running (0m51.0s), 011/100 VUs, 395 complete and 0 interrupted iterations
default   [  30% ] 011/100 VUs  0m51.0s/2m50.0s

running (0m52.0s), 013/100 VUs, 406 complete and 0 interrupted iterations
default   [  31% ] 013/100 VUs  0m52.0s/2m50.0s

running (0m53.0s), 015/100 VUs, 419 complete and 0 interrupted iterations
default   [  31% ] 015/100 VUs  0m53.0s/2m50.0s

running (0m54.0s), 017/100 VUs, 434 complete and 0 interrupted iterations
default   [  32% ] 017/100 VUs  0m54.0s/2m50.0s

running (0m55.0s), 019/100 VUs, 451 complete and 0 interrupted iterations
default   [  32% ] 019/100 VUs  0m55.0s/2m50.0s

running (0m56.0s), 021/100 VUs, 469 complete and 0 interrupted iterations
default   [  33% ] 021/100 VUs  0m56.0s/2m50.0s

running (0m57.0s), 023/100 VUs, 490 complete and 0 interrupted iterations
default   [  34% ] 023/100 VUs  0m57.0s/2m50.0s

running (0m58.0s), 025/100 VUs, 513 complete and 0 interrupted iterations
default   [  34% ] 025/100 VUs  0m58.0s/2m50.0s

running (0m59.0s), 027/100 VUs, 538 complete and 0 interrupted iterations
default   [  35% ] 027/100 VUs  0m59.0s/2m50.0s

running (1m00.0s), 029/100 VUs, 565 complete and 0 interrupted iterations
default   [  35% ] 029/100 VUs  1m00.0s/2m50.0s

running (1m01.0s), 031/100 VUs, 594 complete and 0 interrupted iterations
default   [  36% ] 031/100 VUs  1m01.0s/2m50.0s

running (1m02.0s), 033/100 VUs, 625 complete and 0 interrupted iterations
default   [  36% ] 033/100 VUs  1m02.0s/2m50.0s

running (1m03.0s), 035/100 VUs, 658 complete and 0 interrupted iterations
default   [  37% ] 035/100 VUs  1m03.0s/2m50.0s

running (1m04.0s), 037/100 VUs, 687 complete and 0 interrupted iterations
default   [  38% ] 037/100 VUs  1m04.0s/2m50.0s

running (1m05.0s), 039/100 VUs, 724 complete and 0 interrupted iterations
default   [  38% ] 039/100 VUs  1m05.0s/2m50.0s

running (1m06.0s), 041/100 VUs, 763 complete and 0 interrupted iterations
default   [  39% ] 041/100 VUs  1m06.0s/2m50.0s

running (1m07.0s), 043/100 VUs, 804 complete and 0 interrupted iterations
default   [  39% ] 043/100 VUs  1m07.0s/2m50.0s

running (1m08.0s), 045/100 VUs, 847 complete and 0 interrupted iterations
default   [  40% ] 045/100 VUs  1m08.0s/2m50.0s

running (1m09.0s), 047/100 VUs, 892 complete and 0 interrupted iterations
default   [  41% ] 047/100 VUs  1m09.0s/2m50.0s

running (1m10.0s), 049/100 VUs, 939 complete and 0 interrupted iterations
default   [  41% ] 049/100 VUs  1m10.0s/2m50.0s

running (1m11.0s), 050/100 VUs, 988 complete and 0 interrupted iterations
default   [  42% ] 050/100 VUs  1m11.0s/2m50.0s

running (1m12.0s), 050/100 VUs, 1038 complete and 0 interrupted iterations
default   [  42% ] 050/100 VUs  1m12.0s/2m50.0s

running (1m13.0s), 050/100 VUs, 1088 complete and 0 interrupted iterations
default   [  43% ] 050/100 VUs  1m13.0s/2m50.0s

running (1m14.0s), 050/100 VUs, 1138 complete and 0 interrupted iterations
default   [  44% ] 050/100 VUs  1m14.0s/2m50.0s

running (1m15.0s), 050/100 VUs, 1188 complete and 0 interrupted iterations
default   [  44% ] 050/100 VUs  1m15.0s/2m50.0s

running (1m16.0s), 050/100 VUs, 1238 complete and 0 interrupted iterations
default   [  45% ] 050/100 VUs  1m16.0s/2m50.0s

running (1m17.0s), 050/100 VUs, 1288 complete and 0 interrupted iterations
default   [  45% ] 050/100 VUs  1m17.0s/2m50.0s

running (1m18.0s), 050/100 VUs, 1338 complete and 0 interrupted iterations
default   [  46% ] 050/100 VUs  1m18.0s/2m50.0s

running (1m19.0s), 050/100 VUs, 1388 complete and 0 interrupted iterations
default   [  46% ] 050/100 VUs  1m19.0s/2m50.0s

running (1m20.0s), 050/100 VUs, 1438 complete and 0 interrupted iterations
default   [  47% ] 050/100 VUs  1m20.0s/2m50.0s

running (1m21.0s), 050/100 VUs, 1488 complete and 0 interrupted iterations
default   [  48% ] 050/100 VUs  1m21.0s/2m50.0s

running (1m22.0s), 050/100 VUs, 1538 complete and 0 interrupted iterations
default   [  48% ] 050/100 VUs  1m22.0s/2m50.0s

running (1m23.0s), 050/100 VUs, 1588 complete and 0 interrupted iterations
default   [  49% ] 050/100 VUs  1m23.0s/2m50.0s

running (1m24.0s), 050/100 VUs, 1638 complete and 0 interrupted iterations
default   [  49% ] 050/100 VUs  1m24.0s/2m50.0s

running (1m25.0s), 050/100 VUs, 1688 complete and 0 interrupted iterations
default   [  50% ] 050/100 VUs  1m25.0s/2m50.0s

running (1m26.0s), 050/100 VUs, 1738 complete and 0 interrupted iterations
default   [  51% ] 050/100 VUs  1m26.0s/2m50.0s

running (1m27.0s), 050/100 VUs, 1788 complete and 0 interrupted iterations
default   [  51% ] 050/100 VUs  1m27.0s/2m50.0s

running (1m28.0s), 050/100 VUs, 1831 complete and 0 interrupted iterations
default   [  52% ] 050/100 VUs  1m28.0s/2m50.0s

running (1m29.0s), 050/100 VUs, 1867 complete and 0 interrupted iterations
default   [  52% ] 050/100 VUs  1m29.0s/2m50.0s

running (1m30.0s), 050/100 VUs, 1916 complete and 0 interrupted iterations
default   [  53% ] 050/100 VUs  1m30.0s/2m50.0s

running (1m31.0s), 050/100 VUs, 1966 complete and 0 interrupted iterations
default   [  54% ] 050/100 VUs  1m31.0s/2m50.0s

running (1m32.0s), 050/100 VUs, 2016 complete and 0 interrupted iterations
default   [  54% ] 050/100 VUs  1m32.0s/2m50.0s

running (1m33.0s), 050/100 VUs, 2066 complete and 0 interrupted iterations
default   [  55% ] 050/100 VUs  1m33.0s/2m50.0s

running (1m34.0s), 050/100 VUs, 2116 complete and 0 interrupted iterations
default   [  55% ] 050/100 VUs  1m34.0s/2m50.0s

running (1m35.0s), 050/100 VUs, 2166 complete and 0 interrupted iterations
default   [  56% ] 050/100 VUs  1m35.0s/2m50.0s

running (1m36.0s), 050/100 VUs, 2216 complete and 0 interrupted iterations
default   [  56% ] 050/100 VUs  1m36.0s/2m50.0s

running (1m37.0s), 050/100 VUs, 2266 complete and 0 interrupted iterations
default   [  57% ] 050/100 VUs  1m37.0s/2m50.0s

running (1m38.0s), 050/100 VUs, 2315 complete and 0 interrupted iterations
default   [  58% ] 050/100 VUs  1m38.0s/2m50.0s

running (1m39.0s), 050/100 VUs, 2365 complete and 0 interrupted iterations
default   [  58% ] 050/100 VUs  1m39.0s/2m50.0s

running (1m40.0s), 050/100 VUs, 2415 complete and 0 interrupted iterations
default   [  59% ] 050/100 VUs  1m40.0s/2m50.0s

running (1m41.0s), 052/100 VUs, 2465 complete and 0 interrupted iterations
default   [  59% ] 052/100 VUs  1m41.0s/2m50.0s

running (1m42.0s), 054/100 VUs, 2517 complete and 0 interrupted iterations
default   [  60% ] 054/100 VUs  1m42.0s/2m50.0s

running (1m43.0s), 057/100 VUs, 2571 complete and 0 interrupted iterations
default   [  61% ] 057/100 VUs  1m43.0s/2m50.0s

running (1m44.0s), 059/100 VUs, 2628 complete and 0 interrupted iterations
default   [  61% ] 059/100 VUs  1m44.0s/2m50.0s

running (1m45.0s), 062/100 VUs, 2687 complete and 0 interrupted iterations
default   [  62% ] 062/100 VUs  1m45.0s/2m50.0s

running (1m46.0s), 064/100 VUs, 2749 complete and 0 interrupted iterations
default   [  62% ] 064/100 VUs  1m46.0s/2m50.0s

running (1m47.0s), 067/100 VUs, 2813 complete and 0 interrupted iterations
default   [  63% ] 067/100 VUs  1m47.0s/2m50.0s

running (1m48.0s), 069/100 VUs, 2880 complete and 0 interrupted iterations
default   [  64% ] 069/100 VUs  1m48.0s/2m50.0s

running (1m49.0s), 072/100 VUs, 2949 complete and 0 interrupted iterations
default   [  64% ] 072/100 VUs  1m49.0s/2m50.0s

running (1m50.0s), 074/100 VUs, 3012 complete and 0 interrupted iterations
default   [  65% ] 074/100 VUs  1m50.0s/2m50.0s

running (1m51.0s), 077/100 VUs, 3073 complete and 0 interrupted iterations
default   [  65% ] 077/100 VUs  1m51.0s/2m50.0s

running (1m52.0s), 079/100 VUs, 3144 complete and 0 interrupted iterations
default   [  66% ] 079/100 VUs  1m52.0s/2m50.0s

running (1m53.0s), 082/100 VUs, 3223 complete and 0 interrupted iterations
default   [  66% ] 082/100 VUs  1m53.0s/2m50.0s

running (1m54.0s), 084/100 VUs, 3305 complete and 0 interrupted iterations
default   [  67% ] 084/100 VUs  1m54.0s/2m50.0s

running (1m55.0s), 087/100 VUs, 3389 complete and 0 interrupted iterations
default   [  68% ] 087/100 VUs  1m55.0s/2m50.0s

running (1m56.0s), 089/100 VUs, 3476 complete and 0 interrupted iterations
default   [  68% ] 089/100 VUs  1m56.0s/2m50.0s

running (1m57.0s), 092/100 VUs, 3564 complete and 0 interrupted iterations
default   [  69% ] 092/100 VUs  1m57.0s/2m50.0s

running (1m58.0s), 094/100 VUs, 3655 complete and 0 interrupted iterations
default   [  69% ] 094/100 VUs  1m58.0s/2m50.0s

running (1m59.0s), 097/100 VUs, 3749 complete and 0 interrupted iterations
default   [  70% ] 097/100 VUs  1m59.0s/2m50.0s

running (2m00.0s), 099/100 VUs, 3846 complete and 0 interrupted iterations
default   [  71% ] 099/100 VUs  2m00.0s/2m50.0s

running (2m01.0s), 100/100 VUs, 3944 complete and 0 interrupted iterations
default   [  71% ] 100/100 VUs  2m01.0s/2m50.0s

running (2m02.0s), 100/100 VUs, 4044 complete and 0 interrupted iterations
default   [  72% ] 100/100 VUs  2m02.0s/2m50.0s

running (2m03.0s), 100/100 VUs, 4144 complete and 0 interrupted iterations
default   [  72% ] 100/100 VUs  2m03.0s/2m50.0s

running (2m04.0s), 100/100 VUs, 4243 complete and 0 interrupted iterations
default   [  73% ] 100/100 VUs  2m04.0s/2m50.0s

running (2m05.0s), 100/100 VUs, 4343 complete and 0 interrupted iterations
default   [  74% ] 100/100 VUs  2m05.0s/2m50.0s

running (2m06.0s), 100/100 VUs, 4443 complete and 0 interrupted iterations
default   [  74% ] 100/100 VUs  2m06.0s/2m50.0s

running (2m07.0s), 100/100 VUs, 4543 complete and 0 interrupted iterations
default   [  75% ] 100/100 VUs  2m07.0s/2m50.0s

running (2m08.0s), 100/100 VUs, 4642 complete and 0 interrupted iterations
default   [  75% ] 100/100 VUs  2m08.0s/2m50.0s

running (2m09.0s), 100/100 VUs, 4742 complete and 0 interrupted iterations
default   [  76% ] 100/100 VUs  2m09.0s/2m50.0s

running (2m10.0s), 100/100 VUs, 4841 complete and 0 interrupted iterations
default   [  76% ] 100/100 VUs  2m10.0s/2m50.0s

running (2m11.0s), 100/100 VUs, 4941 complete and 0 interrupted iterations
default   [  77% ] 100/100 VUs  2m11.0s/2m50.0s

running (2m12.0s), 100/100 VUs, 5040 complete and 0 interrupted iterations
default   [  78% ] 100/100 VUs  2m12.0s/2m50.0s

running (2m13.0s), 100/100 VUs, 5140 complete and 0 interrupted iterations
default   [  78% ] 100/100 VUs  2m13.0s/2m50.0s

running (2m14.0s), 100/100 VUs, 5237 complete and 0 interrupted iterations
default   [  79% ] 100/100 VUs  2m14.0s/2m50.0s

running (2m15.0s), 100/100 VUs, 5336 complete and 0 interrupted iterations
default   [  79% ] 100/100 VUs  2m15.0s/2m50.0s

running (2m16.0s), 100/100 VUs, 5436 complete and 0 interrupted iterations
default   [  80% ] 100/100 VUs  2m16.0s/2m50.0s

running (2m17.0s), 100/100 VUs, 5536 complete and 0 interrupted iterations
default   [  81% ] 100/100 VUs  2m17.0s/2m50.0s

running (2m18.0s), 100/100 VUs, 5636 complete and 0 interrupted iterations
default   [  81% ] 100/100 VUs  2m18.0s/2m50.0s

running (2m19.0s), 100/100 VUs, 5730 complete and 0 interrupted iterations
default   [  82% ] 100/100 VUs  2m19.0s/2m50.0s

running (2m20.0s), 100/100 VUs, 5811 complete and 0 interrupted iterations
default   [  82% ] 100/100 VUs  2m20.0s/2m50.0s

running (2m21.0s), 100/100 VUs, 5901 complete and 0 interrupted iterations
default   [  83% ] 100/100 VUs  2m21.0s/2m50.0s

running (2m22.0s), 100/100 VUs, 6001 complete and 0 interrupted iterations
default   [  84% ] 100/100 VUs  2m22.0s/2m50.0s

running (2m23.0s), 100/100 VUs, 6101 complete and 0 interrupted iterations
default   [  84% ] 100/100 VUs  2m23.0s/2m50.0s

running (2m24.0s), 100/100 VUs, 6201 complete and 0 interrupted iterations
default   [  85% ] 100/100 VUs  2m24.0s/2m50.0s

running (2m25.0s), 100/100 VUs, 6301 complete and 0 interrupted iterations
default   [  85% ] 100/100 VUs  2m25.0s/2m50.0s

running (2m26.0s), 100/100 VUs, 6401 complete and 0 interrupted iterations
default   [  86% ] 100/100 VUs  2m26.0s/2m50.0s

running (2m27.0s), 100/100 VUs, 6501 complete and 0 interrupted iterations
default   [  86% ] 100/100 VUs  2m27.0s/2m50.0s

running (2m28.0s), 100/100 VUs, 6601 complete and 0 interrupted iterations
default   [  87% ] 100/100 VUs  2m28.0s/2m50.0s

running (2m29.0s), 100/100 VUs, 6701 complete and 0 interrupted iterations
default   [  88% ] 100/100 VUs  2m29.0s/2m50.0s

running (2m30.0s), 100/100 VUs, 6801 complete and 0 interrupted iterations
default   [  88% ] 100/100 VUs  2m30.0s/2m50.0s

running (2m31.0s), 098/100 VUs, 6901 complete and 0 interrupted iterations
default   [  89% ] 098/100 VUs  2m31.0s/2m50.0s

running (2m32.0s), 093/100 VUs, 6999 complete and 0 interrupted iterations
default   [  89% ] 093/100 VUs  2m32.0s/2m50.0s

running (2m33.0s), 088/100 VUs, 7081 complete and 0 interrupted iterations
default   [  90% ] 088/100 VUs  2m33.0s/2m50.0s

running (2m34.0s), 084/100 VUs, 7150 complete and 0 interrupted iterations
default   [  91% ] 084/100 VUs  2m34.0s/2m50.0s

running (2m35.0s), 079/100 VUs, 7219 complete and 0 interrupted iterations
default   [  91% ] 079/100 VUs  2m35.0s/2m50.0s

running (2m36.0s), 074/100 VUs, 7298 complete and 0 interrupted iterations
default   [  92% ] 074/100 VUs  2m36.0s/2m50.0s

running (2m37.0s), 069/100 VUs, 7372 complete and 0 interrupted iterations
default   [  92% ] 069/100 VUs  2m37.0s/2m50.0s

running (2m38.0s), 063/100 VUs, 7441 complete and 0 interrupted iterations
default   [  93% ] 063/100 VUs  2m38.0s/2m50.0s

running (2m39.0s), 058/100 VUs, 7504 complete and 0 interrupted iterations
default   [  94% ] 058/100 VUs  2m39.0s/2m50.0s

running (2m40.0s), 054/100 VUs, 7562 complete and 0 interrupted iterations
default   [  94% ] 054/100 VUs  2m40.0s/2m50.0s

running (2m41.0s), 049/100 VUs, 7616 complete and 0 interrupted iterations
default   [  95% ] 049/100 VUs  2m41.0s/2m50.0s

running (2m42.0s), 044/100 VUs, 7665 complete and 0 interrupted iterations
default   [  95% ] 044/100 VUs  2m42.0s/2m50.0s

running (2m43.0s), 038/100 VUs, 7709 complete and 0 interrupted iterations
default   [  96% ] 038/100 VUs  2m43.0s/2m50.0s

running (2m44.0s), 033/100 VUs, 7747 complete and 0 interrupted iterations
default   [  96% ] 033/100 VUs  2m44.0s/2m50.0s

running (2m45.0s), 028/100 VUs, 7780 complete and 0 interrupted iterations
default   [  97% ] 028/100 VUs  2m45.0s/2m50.0s

running (2m46.0s), 023/100 VUs, 7808 complete and 0 interrupted iterations
default   [  98% ] 023/100 VUs  2m46.0s/2m50.0s

running (2m47.0s), 018/100 VUs, 7831 complete and 0 interrupted iterations
default   [  98% ] 018/100 VUs  2m47.0s/2m50.0s

running (2m48.0s), 013/100 VUs, 7849 complete and 0 interrupted iterations
default   [  99% ] 013/100 VUs  2m48.0s/2m50.0s

running (2m49.0s), 007/100 VUs, 7862 complete and 0 interrupted iterations
default   [  99% ] 007/100 VUs  2m49.0s/2m50.0s

running (2m50.0s), 003/100 VUs, 7869 complete and 0 interrupted iterations
default   [ 100% ] 003/100 VUs  2m50.0s/2m50.0s


  █ TOTAL RESULTS 

    checks_total.......: 7872    46.180886/s
    checks_succeeded...: 100.00% 7872 out of 7872
    checks_failed......: 0.00%   0 out of 7872

    ✓ status is 200

    HTTP
    http_req_duration..............: avg=20.86ms min=5.14ms med=19.63ms max=209.5ms p(90)=31.6ms p(95)=34.63ms
      { expected_response:true }...: avg=20.86ms min=5.14ms med=19.63ms max=209.5ms p(90)=31.6ms p(95)=34.63ms
    http_req_failed................: 0.00%  0 out of 7872
    http_reqs......................: 7872   46.180886/s

    EXECUTION
    iteration_duration.............: avg=1.02s   min=1s     med=1.02s   max=1.21s   p(90)=1.03s  p(95)=1.03s  
    iterations.....................: 7872   46.180886/s
    vus............................: 3      min=1         max=100
    vus_max........................: 100    min=100       max=100

    NETWORK
    data_received..................: 632 MB 3.7 MB/s
    data_sent......................: 2.3 MB 13 kB/s



running (2m50.5s), 000/100 VUs, 7872 complete and 0 interrupted iterations
default ✓ [ 100% ] 000/100 VUs  2m50s